OpenFOAM/Spalart-Allmaras/Fine-Mesh/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cylinder
{
    surfaces
    (
        "nozzle_ext.stl"
        "nozzle_int.stl"
        "collector_ext.stl"
        "collector_int.stl"
        "diffuser_ext.stl"
        "diffuser_int.stl"
    );

    includedAngle       120;
    geometricTestOnly   yes;
}


// ************************************************************************* //
